castagnoemanuele/STM32-smart-alarm/Smart-Alarm/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Smart Alarm System with Reed Switch
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "config.h"
#include "display.h"
#include "flashMemory.h"
#include "stdio.h"
#include "string.h"
#include "ctype.h"
#include "pinCode.h"
#include "RFID.h"
#include "esp32.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
DMA_HandleTypeDef hdma_i2c1_rx;
DMA_HandleTypeDef hdma_i2c1_tx;

SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
DMA_HandleTypeDef hdma_tim1_up;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
volatile uint8_t alarm_flag = 0;
volatile uint8_t key_pressed = 0;
volatile uint8_t reed_triggered = 0;
char last_key = '\0';
uint32_t last_key_time = 0;
uint32_t last_reed_time = 0;

PincodeState pincodeState;
bool wifi_connected = false;
char rx_data[DATA_SIZE];
char device_ip[32]; //Used to store ip string from the ESP32

uint8_t value = 0;
char str1[17] = { '\0' };
char str2[17] = { '\0' };
char str3[17] = { '\0' };
char str4[17] = { '\0' };
char tmp_str[65] = { '\0' };

// Timing variables
uint32_t last_keypad_scan = 0;
uint32_t last_reed_check = 0;
uint32_t last_alarm_toggle = 0;
uint32_t last_rfid_check = 0;
uint32_t last_wifi_check = 0;

// Delay function:
#define	Precise_Delay(x) {\
	uint32_t x1 = x * 72;\
	DWT->CYCCNT = 0;\
	while (DWT->CYCCNT < x1);\
}



////
//
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM1_Init(void);
static void MX_SPI3_Init(void);
/* USER CODE BEGIN PFP */
int ScanI2CDevices(void);

char scan_keypad(void);
void handle_keypress(char key);
void TriggerAlarm(void);
void StopAlarm(void);
void HandleReedSwitch(void);
void esp32getIP_nonblocking(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
int __io_putchar(int ch) {
	HAL_UART_Transmit(&huart2, (uint8_t*) &ch, 1, HAL_MAX_DELAY);
	return ch;
}
int fputc(int ch, FILE *f) {
	return __io_putchar(ch);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	uint8_t data[] = { 0xFF, 0x0 };
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_SPI3_Init();
  /* USER CODE BEGIN 2 */
	setvbuf(stdout, NULL, _IONBF, 0); //disable waiting for newline
	printf("Booting STM32...\r\n");
	Display_Init();
	Display_BootMessage();
	printf("Display initialized...\r\n");
	Pincode_Init(&pincodeState);



	// Enable ESP32
	HAL_GPIO_WritePin(GPIOB, ESP32_EN, GPIO_PIN_SET);
	HAL_Delay(5000); // Give time to the ESP to boot

	// Read saved pincode from flash
	uint32_t saved_pincode = ReadFromFlash(address1);
	char pincode_str[12];
	sprintf(pincode_str, "%lu", (unsigned long) saved_pincode);

	// Scan I2C devices

	ScanI2CDevices();
	HAL_Delay(1000);

	// Get IP from ESP32
	printf("\nRequesting IP address to ESP32");
	esp32getIP_nonblocking();


	HAL_Delay(1000);
	// Show system status
	Display_SystemStatus(pincodeState.system_armed);
	uint32_t start_time = 0;
	bool toggle = false;
	char pressed_key = '\0';
	if (wifi_connected) {
		HAL_TIM_Base_Start(&htim1);
		HAL_DMA_Start(&hdma_tim1_up, (uint32_t) data, (uint32_t) &GPIOA->ODR,
				5);
		__HAL_TIM_ENABLE_DMA(&htim1, TIM_DMA_UPDATE);
	}


	//
	//Initialize RFID
	printf("Resetting SPI...\n");
	__HAL_RCC_SPI1_FORCE_RESET();  // Forza il reset dell'SPI
	HAL_Delay(10);                 // Attendi 10ms
	__HAL_RCC_SPI1_RELEASE_RESET(); // Rilascia il reset
	HAL_SPI_Init(&hspi3);          // Reinizializza l'SPI
	MFRC522_Init();                // Reinizializza il lettore RFID

	HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_RESET);
	HAL_Delay(10);
	HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_SET);
	HAL_Delay(10);
	MFRC522_Init();  //
	printf("\nSearching for an RC522\r\n");
	HAL_Delay(1000);
	RFIDstatus = Read_MFRC522(VersionReg);
	sprintf(str1, "\nRunning RC522\r\n");
	sprintf(str2, "\nver:%x\r\n", RFIDstatus);
	printf("%s\r\n", str1);
	printf("%s\r\n", str2);

  /* USER CODE END 2 */

