castagnoemanuele/STM32-smart-alarm/Smart-Alarm/Core/Src/main.c
void TriggerAlarm(void) {
	alarm_flag = 1;
	HAL_GPIO_WritePin(GPIOA, BUZZER_PIN, GPIO_PIN_SET);
}

void StopAlarm(void) {
	alarm_flag = 0;
	HAL_GPIO_WritePin(GPIOA, BUZZER_PIN, GPIO_PIN_RESET);
	ssd1306_Fill(Black);
	ssd1306_UpdateScreen();
	Display_SystemStatus(pincodeState.system_armed);
}

int ScanI2CDevices(void) {
    const char StartMSG[] = "Starting I2C scan...\r\n";
    const char EndMSG[] = "\r\nI2C scan complete.\r\n";
    const char Space[] = " ";
    char Buffer[32];

    uint8_t i, ret;
    char buffer[16];
    int found = 0;

    ssd1306_Fill(Black);
    ssd1306_SetCursor(0, 0);
    ssd1306_WriteString("I2C Scan:", Font_7x10, White);
    ssd1306_UpdateScreen();

    HAL_Delay(500);

    printf("%s", StartMSG);

    for (i = 1; i < 128; i++) {
        ret = HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t) (i << 1), 3, 5);
        if (ret == HAL_OK) {
            int len = sprintf(Buffer, "0x%02X ", i);
            HAL_UART_Transmit(&huart2, (uint8_t*)Buffer, len, 100);

            sprintf(buffer, "Found: 0x%02X", i);
            ssd1306_SetCursor(0, 16 + found * 10);
            ssd1306_WriteString(buffer, Font_6x8, White);
            ssd1306_UpdateScreen();

            HAL_Delay(300);
            found++;
            if (found > 4)
                break;
        } else {
            HAL_UART_Transmit(&huart2, (uint8_t*)Space, 1, 100);
        }
    }

    HAL_UART_Transmit(&huart2, (uint8_t*)EndMSG, strlen(EndMSG), 100);
    return found;
}

void esp32getIP_nonblocking(void) {
    HAL_StatusTypeDef status;
    static uint8_t attempt = 0;

    // Only check every 2 sec
    if (HAL_GetTick() - last_wifi_check < WIFI_CHECK_INTERVAL) {
        return;
    }
    last_wifi_check = HAL_GetTick();

    uint8_t rx_data[32];
    status = HAL_I2C_Master_Receive(&hi2c1, (I2C_ADDR << 1), rx_data, 32, 100);

    if (status == HAL_OK) {
        rx_data[31] = '\0';

        // Clean \r or \n
        for (int i = 0; i < 32; i++) {
            if (rx_data[i] == '\r' || rx_data[i] == '\n') {
                rx_data[i] = '\0';
                break;
            }
        }

        strncpy(device_ip, (char *)rx_data, sizeof(device_ip));
        device_ip[sizeof(device_ip) - 1] = '\0';

        if (is_valid_ip(device_ip)) {
            printf("\nReceived valid IP: %s\n", device_ip);
            Display_IPAddress(device_ip);
            wifi_connected = true;
            attempt = 0;
        } else {
            printf("\nInvalid IP format received: %s\n", device_ip);
            attempt++;
        }
    } else {
        printf("\nNo IP address received (I2C error)\n");
        attempt++;
    }

    if (attempt >= 5) {
        strcpy(device_ip, "ERROR");
        Display_IPAddress(device_ip);
        attempt = 0;
    }
}



char scan_keypad(void) {
	char key = '\0';
	uint8_t row, col;

	for (row = 0; row < 4; row++) {
		HAL_GPIO_WritePin(ROW_PORT, ROW1_PIN | ROW2_PIN | ROW3_PIN | ROW4_PIN,
				GPIO_PIN_SET);
		switch (row) {
		case 0:
			HAL_GPIO_WritePin(ROW_PORT, ROW1_PIN, GPIO_PIN_RESET);
			break;
		case 1:
			HAL_GPIO_WritePin(ROW_PORT, ROW2_PIN, GPIO_PIN_RESET);
			break;
		case 2:
			HAL_GPIO_WritePin(ROW_PORT, ROW3_PIN, GPIO_PIN_RESET);
			break;
		case 3:
			HAL_GPIO_WritePin(ROW_PORT, ROW4_PIN, GPIO_PIN_RESET);
			break;
		}

		HAL_Delay(1);

		if (HAL_GPIO_ReadPin(COL_PORT, COL1_PIN) == GPIO_PIN_RESET) {
			key = keypad[row][0];
		} else if (HAL_GPIO_ReadPin(COL_PORT, COL2_PIN) == GPIO_PIN_RESET) {
			key = keypad[row][1];
		} else if (HAL_GPIO_ReadPin(COL_PORT, COL3_PIN) == GPIO_PIN_RESET) {
			key = keypad[row][2];
		} else if (HAL_GPIO_ReadPin(COL_PORT, COL4_PIN) == GPIO_PIN_RESET) {
			key = keypad[row][3];
		}

		if (key != '\0') {
			if (key
					== last_key&& (HAL_GetTick() - last_key_time) < KEY_DEBOUNCE_MS) {
				return '\0';
			}
			last_key = key;
			last_key_time = HAL_GetTick();
			return key;
		}
	}

	return '\0';
}

void handle_keypress(char key) {
	if (key == '\0')
		return;

	printf("Key pressed: %c\r\n", key);

	switch (key) {
	case 'A':
		if (!pincodeState.system_armed && !pincodeState.system_locked) {
			pincodeState.pincode_position = 0;
			memset(pincodeState.entered_pincode, 0,
					sizeof(pincodeState.entered_pincode));
			Display_EnterPincode(pincodeState.pincode_position,
					pincodeState.entered_pincode);
		}
		break;

	case 'B':
		if (pincodeState.system_armed && !pincodeState.system_locked) {
			pincodeState.pincode_position = 0;
			memset(pincodeState.entered_pincode, 0,
					sizeof(pincodeState.entered_pincode));
			Display_EnterPincode(pincodeState.pincode_position,
					pincodeState.entered_pincode);
		}
		break;

	case 'C':
		pincodeState.pincode_position = 0;
		memset(pincodeState.entered_pincode, 0,
				sizeof(pincodeState.entered_pincode));
		Display_SystemStatus(pincodeState.system_armed);
		break;

	case 'D':
		if (pincodeState.pincode_position == PINCODE_LENGTH) {
			Pincode_Check(&pincodeState);
		}
		break;

	case '*':
		pincodeState.pincode_position = 0;
		memset(pincodeState.entered_pincode, 0,
				sizeof(pincodeState.entered_pincode));
		Display_EnterPincode(pincodeState.pincode_position,
				pincodeState.entered_pincode);
		break;

	case '#':
		break;

	default:
		if (pincodeState.pincode_position < PINCODE_LENGTH && isdigit(key)) {
			pincodeState.entered_pincode[pincodeState.pincode_position++] = key;
			Display_EnterPincode(pincodeState.pincode_position,
					pincodeState.entered_pincode);
		}
		break;
	}
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM2) {
		printf("DMA transfer completed for TIM2_CH1.\n");
	}
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
